uhnp/src/Enums/СтатусыВнутреннихЗаказов/СтатусыВнутреннихЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыВнутреннихЗаказов</name>
  <enumValues>
    <name>УдалитьКОбеспечению</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СтатусыВнутреннихЗаказов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список выбора статуса, в зависимости от включенных опций
//
// Параметры:
//  ДанныеВыбора			 - СписокЗначений из ПеречислениеСсылка.СтатусыВнутреннихЗаказов - заполняемый список значений
//  ИспользоватьСтатусНаСогласовании - Булево	 - признак необходимости использования статуса "НаСогласовании".
//
Процедура ЗаполнитьСписокВыбора(ДанныеВыбора, ИспользоватьСтатусНаСогласовании) Экспорт
	
	ДанныеВыбора.Очистить();
	
	Если ИспользоватьСтатусНаСогласовании Тогда
		ДанныеВыбора.Добавить(Перечисления.СтатусыВнутреннихЗаказов.НаСогласовании);
	КонецЕсли;
	
	// Безусловные статусы
	ДанныеВыбора.Добавить(Перечисления.СтатусыВнутреннихЗаказов.КВыполнению);
	ДанныеВыбора.Добавить(Перечисления.СтатусыВнутреннихЗаказов.Закрыт);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
